package cn.elam.app.spider.NaviveBayesClassify.textSample;

public class Topics {

	public static String SPORT_TOPIC = "新快报讯 亚运会“改分事件”继续发展，邵斌目前在北京准备材料，即将赴洛桑参加国际体联的听证会。他表示如果自己的解释不能让国际体联满意的话，他将向国际仲裁法庭控告国际体联。　准备在听证会解释  3月18日，邵斌接到中国体操协会的通知来到北京准备材料应对听证会。目前邵斌已经抵京，并在准备参加听证会的材料。"
			+ "根据程序，邵斌赴洛桑后需要先提交一份书面材料，然后和三位专家进行面谈，之后等待国际体联的判决结果。"
			+ "(书面材料)把事情的原委全部以书面的形式写清楚，看我的解释和澄清能不能让国际体联满意。如果对方不满意，仍要追究我的责任，而结果又不合理，我不排除提出上诉，我会反过来告国际体联，这几天我已经和律师咨询过了相关程序。 "
			+ "邵斌表示届时可能向国际仲裁法庭提出诉讼。不久前，佟文就禁药事件向国际仲裁法庭申诉，最终胜出。"
			+ "话锋直指高级裁判"
			+ "前日，当时任高级裁判组组长的斯托伊卡表示，他曾试图在现场挽救错失，但是因打分系统没有记录原始得分，最终只能被迫接受了被公布在大屏幕的得分。"
			+ "对于斯托伊卡这个说法，邵斌也直接给予了反驳：“他的话漏洞很多，这明显是在推卸责任。他作为高级裁判组组长的职责是什么？”"
			+ "邵斌表示还不清楚听证会结果会如何，目前只能是按要求到京配合相关调查，至于何时启程赴洛桑，还要等待国际体联的通知。"
			+ "事件回放"
			+ "●3月16日"
			+ "国际体操联合会(FIG)宣布对中国男子竞技体操裁判邵斌涉嫌违反裁判规则和体育道德的行为提出诉讼。称在亚运会体操比赛中，邵斌在没有请示高级裁判组的情况下“修改”了完成分，导致中国运动员张成龙从第二位变为与韩国运动员金洙眠并列第一。"
			+ "●3月17日下午"
			+ "中国体操协会副秘书长潘辰飞在接受媒体采访时表示改分“纯属邵斌私人的事情，擅自做了决定”。"
			+ "●3月18日"
			+ "邵斌接到通知从上海前往北京，配合调查。邵斌在接受采访时也表示，韩国选手金洙眠的得分偏高，而改分是在韩国裁判共同决定后执行的，目的是为了“保护我们运动员实际的表现，维护他们的利益”。"
			+ "中国体操队总教头黄玉斌力挺邵斌：“我就跟邵斌说，你要挺直腰杆，你是正义者。大家不要以为多数裁判打出的分数就是真理。”并质问国际体联男子技术委员会主席斯托伊卡如果发现不对，当时为何不阻止改分。"
			+ "●3月19日"
			+ "斯托伊卡表示并没有默许改分，只是当时的打分系统不允许他将E分改回，他无奈才出此下策。但为何不重新打分和为何会在成绩表上签名，斯托伊卡没有回答。";

	public static String IT_TOPIC = "微软公司提出以446亿美元的价格收购雅虎中国网2月1日报道 美联社消息，微软公司提出以446亿美元现金加股票的价格收购搜索网站雅虎公司。微软提出以每股31美元的价格收购雅虎。微软的收购报价较雅虎1月31日的收盘价19.18美元溢价62%。微软公司称雅虎公司的股东可以选择以现金或股票进行交易。微软和雅虎公司在2006年底和2007年初已在寻求双方合作。而近两年，雅虎一直处于困境：市场份额下滑、运营业绩不佳、股价大幅下跌。对于力图在互联网市场有所作为的微软来说，收购雅虎无疑是一条捷径，因为双方具有非常强的互补性。(小桥)";

	public static String SPORT_2_TOPIC = "　在巴塞罗那的辉煌历史中，博扬超越梅西，创下了俱乐部百场联赛出场纪录的最年轻纪录，确切时间为20岁零203天，梅西在达到100场时的成绩为21岁零250天。而在整个西甲联赛历史中，博扬这个岁数可以排在第三小，第一位的是劳尔-冈萨雷斯，他在皇马达成百场时，岁数为19岁零284天，而第二位则是在皇家社会出道，却在毕尔巴鄂竞技达成百场的埃切贝里亚，他的岁数为20岁零177天。当然，无论是劳尔、埃切贝里亚和博扬，都有代表B队打低级别职业联赛的经历，在这里就不在100场统计范畴之内。"
			+ "博扬今天的进球，准确的说是折射，但绝非对方乌龙球，完全是靠着自己的技术和集体的智慧结晶征服对手。梅西突破不成后的送球，其实已经在很大程度上分散了对方的注意力，有超级球星的好处就在于此：梅西在这个点位上，无论自己想突破或者助攻，都能让对手思维不集中，行动无法统一，从而给其他巴萨队员创造好机会。"
			+ "博扬那球后的处理值得一赞，其实也是他这种身高类型的队员所擅长，佯装抽射的动作非常逼真，对方的米盖尔-托雷斯有个停顿，并做出当肉盾挡射的准备，这就足够了，你不上前近身，博扬都有闲暇拉开空间，用左脚瞄准一下后抽射。虽然是折射，但皮球飞行方向不变，都是从左路死角而来。博扬第100场的进球，进的非常之“巴萨”。"
			+ "100场西甲联赛，博扬出场总时间为3900分钟，进了25球，平均159分钟进一球，不那么严酷审视的话，对于20岁的前锋来说，能达到这样的标准已经相当不错。或许曾经有太多的人把博扬看成下一个梅西，却不想仅从岁数差距上看，相差三岁的两人之间，根本构不成“下一个”这个起码得有5年甚至10年来做时间分割的区分标准，他们都是同代队员而已。20岁的博扬逊于20岁的梅西，这个结论没有问题，但逊色于梅西，就不是出色的攻击手吗？更重要的是就没有前途可言？显然这样的结论太狠太极端，也站不住脚。"
			+ "对博扬来说，内心多少也得感谢佩德罗，他的受伤，确实是个天赐的好机会，尽管时间不长。而博扬也的确把握住了这个稍瞬即逝的机会，上轮对塞维利亚，第13分钟替换佩德罗出场后，全场猛轰四次，终于拿下一球，本场虽然实际射门就一次，但天随人愿，一次即告得手。或许瓜帅原先把阿费莱当成博扬的随时替换者，但这两场两球的成绩打出，荷兰人是彻底被压在了板凳上不说，瓜帅要犯难的是：佩德罗已经可以出场，那该如何来调配状态起来的博扬的出场时间？诚如一些观点，博扬和米利托类似，并不好，但却是不可或缺的，因为当赛季中需要替补的时候，就会想到他们。";
}
