package cn.elam.testcases.db;

import java.io.BufferedReader;
import java.io.InputStreamReader;

import cn.elam.util.common.MailBoxService;

public class TestSendMail {

	public static void main(String...args) throws Exception {

		String message = "注意：以下投诉记录无法在校讯通投诉管理中进行自动处理，请核对以下的投诉记录！<br/><br/>1：MISC流水号 : 001400007263781   15868672911<font color=red>       神州行本地</font>      2011-03-10 12:42:27<font color=red>       2011-03-11 00:21:13</font>      紧急<br/>      【受理号码：】15868672911@~【业务名称：】校讯通@~【订购时间：】-@~【学校名称：】天台小学 玉环育才网络有限公司 小二(11)班 金菀其 @~【用户的诉求：】用户表示之前来电屏蔽后还是收到下发信息，要求再次处理！@~【有效的联系电话及联系：】15868672911 机主<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>2：MISC流水号 : 001400007263779   15990878533<font color=red>       神州行本地</font>      2011-03-10 12:34:27<font color=red>       2011-03-11 00:17:13</font>      紧急<br/>      【受理号码：】15990878533@~【业务名称：】校讯通@~【订购时间：】2009-05-26 01:52:09@~【学校名称：】用户未提供@~【用户的诉求：】用户来电表示今年校讯通的信息一个都没有收到过，态度强烈！请核实处理！谢谢！@~【有效的联系电话及联系：】15990878533<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>3：MISC流水号 : 001400007263760   13757050789<font color=red>       神州行本地</font>      2011-03-10 12:31:24<font color=red>       2011-03-11 00:15:42</font>      紧急<br/>      【受理号码：】13757050789@~【业务名称：】校讯通@~【订购时间：】无@~【学校名称：】无@~【用户的诉求：】用户表示自己没有办理业务，但是经常收到信息，要求屏蔽，查询发送代码是：下发成功 10657061550987008 8613757050789 2011-03-09 15:12:44.0 2011-03-09 15:12:44.0@~下发成功 10657061550987039 8613757050789 2011-03-09 14:07:13.0 2011-03-09 14:07:14.0@~【有效的联系电话及联系：】13757050789女士<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>4：MISC流水号 : 001400007263776   13600624455<font color=red>       神州行本地</font>      2011-03-10 12:23:17<font color=red>       2011-03-11 00:11:38</font>      紧急<br/>      【受理号码：】13600624455@~【业务名称：】校讯通@~【订购时间：】@~【学校名称：】@~【用户的诉求：】用户经常收到校讯通信息，但是自己不要这个业务的，请帮助取消并屏蔽，谢谢@~查询下发记录：下发成功 10657061008144 8613600624455 2011-03-09 11:59:09.0 2011-03-09 11:59:10.0@~【有效的联系电话及联系：】本机，周先生<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>5：MISC流水号 : 001400007263774   13780021875<font color=red>       神州行本地</font>      2011-03-10 12:07:04<font color=red>       2011-03-11 00:03:32</font>      紧急<br/>      【手机号码：】13780021875@~【用户的诉求：】用户来电表示自己每天有校讯通的短信，里面的信息内容不是用户的孩子，发送的号码13800571502 10657061005263031   ，学校是杨明小学，孩子姓名：张皓天，老师是戴丽娜，用户要求处理，请审核谢谢！@~【有效的联系电话及联系人：】13780021875<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>6：MISC流水号 : 001400007263769   13586821587<font color=red>       神州行本地</font>      2011-03-10 11:56:24<font color=red>       2011-03-10 23:56:24</font>      紧急<br/>      【手机号码：】13586821587@~【用户的诉求：】用户来电反映有好几天没有收到校讯通的短信了，现用户态度强烈，一定认为是我们这边有问题，请后台处理谢谢！@~【有效的联系电话及联系人：】13586821587 先生<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>7：MISC流水号 : 001400007263768   15167261153<font color=red>       神州行本地</font>      2011-03-10 11:57:01<font color=red>       2011-03-10 23:57:01</font>      紧急<br/>      【受理号码：】15167261153@~【业务名称：】校讯通@~【订购时间：】@~【学校名称：】117|吴兴埭溪中心幼儿园 宁波海曙鑫源网络服务有限公司 小三班 林烽     @~100399717423 15167261153 15167261153  @~校讯通一类套餐B2[收费] 2011-01-18 20:10 否 否 已退订  @~【用户的诉求：】用户要求恢复此前的校讯通，要求尽快开通请处理。@~【有效的联系电话及联系：】15167261153<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>8：MISC流水号 : 001400007263663   15990037608<font color=red>       全球通</font>      2011-03-10 11:38:44<font color=red>       2011-03-10 15:38:44</font>      紧急<br/>      【受理号码：】15990037608@~【业务名称：】校讯通@~【订购时间：】无@~【学校名称：】4287|教育-杭州市朝晖中学 杭州天音计算机系统工程有限公司 初一(12)班 陈益环 @~【用户的诉求：】表示自己当时要求开通的是朝晖中学 陈益环的校讯通，但是现在自己收到的校讯通短信都是属于七色花的。反而朝晖中学的都没有，要求核实请处理。@~【有效的联系电话及联系：】15990037608，先生<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>9：MISC流水号 : 001400007263763   15067611729<font color=red>       神州行本地</font>      2011-03-10 11:27:54<font color=red>       2011-03-10 23:27:54</font>      紧急<br/>      【受理号码：】15067611729@~【业务名称：】@~【订购时间：】@~【学校名称：】@~【用户的诉求：】用户未订制校讯通业务，请帮助屏蔽校讯通短信代码106570610079990009，谢谢@~【有效的联系电话及联系：】15067611729先生<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>10：MISC流水号 : 001400007263759   13646867367<font color=red>       神州行本地</font>      2011-03-10 11:15:40<font color=red>       2011-03-10 23:15:40</font>      紧急<br/>      【受理号码：】13646867367@~【业务名称：】校讯通一类套餐B2@~【订购时间：】2010年12月21@~【学校名称：】萧山区塘湾小学@~【用户的诉求：】该用户来电反映已有一周没有收到校讯通的短信了，请核实处理！！@~【有效的联系电话及联系：】13646867367  先生<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>11：MISC流水号 : 001400007263527   15158806523<font color=red>       全球通</font>      2011-03-10 11:13:01<font color=red>       2011-03-10 15:13:01</font>      紧急<br/>      @~投诉内容：其为萧山区移动用户，反映号码15158806523在其不知情的情况下，被萧山浦阳中学单方面开通“校讯通”功能，月资费9元，其认为不合理，希望相关部门调处。@~查证情况：经核实，关于客户反映其本机号码15158806523在其不知情的情况下开通校讯通业务，查询此号码开通的为萧山浦阳中学校讯通业务，且为客户主动提供校方后至厂家业务办理。之前有反应，现在又不认可，请处理！联系电话：15167141488先生@~<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>12：MISC流水号 : 001400007263756   13738585651<font color=red>       神州行本地</font>      2011-03-10 11:09:12<font color=red>       2011-03-10 23:09:12</font>      紧急<br/>      【受理号码：】13738585651@~【业务名称：】校讯通@~【订购时间：】@~【学校名称：】@~【用户的诉求：】用户没有办理校讯通业务，但是经常收到信息，查询下发记录：@~下发成功 10657061006749047 8613738585651 2011-03-09 16:25:49.0 2011-03-09 16:25:49.0@~下发成功 10657061006749044 8613738585651 2011-03-09 16:19:06.0 2011-03-09 16:19:06.0@~下发成功 10657061006749044 8613738585651 2011-03-09 16:19:06.0 2011-03-09 16:19:11.0@~下发成功 106571610660010016 8613738585651 2011-03-09 15:05:12.0 2011-03-09 15:05:13.0@~下发成功 106571610660010016 8613738585651 2011-03-09 15:05:12.0 2011-03-09 15:05:20.0@~下发成功 106571610651000000 8613738585651 2011-03-09 08:51:23.0 2011-03-09 08:51:23.0@~请帮助屏蔽，谢谢！@~【有效的联系电话及联系：】13738585651女士<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>13：MISC流水号 : 001400007263751   13456384776<font color=red>       神州行本地</font>      2011-03-10 10:50:20<font color=red>       2011-03-10 22:50:20</font>      紧急<br/>      【受理号码：】13456384776@~【业务名称：】校讯通@~【订购时间：】2010-12-21 15:20:05@~【学校名称：】凤鸣街道同福中心小学@~【用户的诉求：】用户来电反映今年从开学到现在都没有收到校讯通下发的短信，用户要求核实，请处理，谢谢！@~【有效的联系电话及联系：】本人本机<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>14：MISC流水号 : 001400007263746   15957571962<font color=red>       神州行本地</font>      2011-03-10 10:33:55<font color=red>       2011-03-10 22:33:55</font>      紧急<br/>      【受理号码：】15957571962@~【业务名称：】校讯通@~【订购时间：】无@~【学校名称：】绍兴群贤小学  五（一） 邹传伟@~【用户的诉求：】用户要求开通校讯通业务，已经向学校申请过了，但是业务一直没有开通，请处理，谢谢。@~【有效的联系电话及联系：】15957571962邹先生<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>15：MISC流水号 : 001400007263743   13967518268<font color=red>       VIP客户</font>      2011-03-10 10:03:29<font color=red>       2011-03-10 12:03:29</font>      紧急<br/>      【受理号码：】13967518268@~【业务名称：】校讯通@~【订购时间：】无@~【学校名称：】嵊州红太阳幼儿园@~【用户的诉求：】VIP用户来电表示自己的校讯通无故被取消，用户要求恢复。请查询处理。谢谢，已有工单20110309101909X88793告知已经恢复了，建议用户关注短信接收情况，用户认可。现在再次来电反映校讯通的短信还是没有收到，前台查询程控上也没有该业务，故再次提交工单@~【有效的联系电话及联系：】本机，李小姐<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>16：MISC流水号 : 001400007263741   13858439828<font color=red>       神州行本地</font>      2011-03-10 09:44:58<font color=red>       2011-03-10 21:44:58</font>      紧急<br/>      【受理号码：】13858439828  @~【业务名称：】校讯通@~【订购时间：】@~【学校名称：】2864|新昌县城关中学 浙江万朋网络技术有限公司 初一(8)班 沈跃     @~107599626200 13858439828 13858439828  @~校讯通一类套餐A[收费] 2010-11-25 17:13 是 是 同步成功  @~ 【用户的诉求：】用户校讯通信息这个学期都没有收到过，查询没有下发记录，用户表示昨天小孩子放学下午4点多的时候是有刷卡的，这个信息也没有收到，请帮助核实，谢谢@~【有效的联系电话及联系：】13858439828  女士<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>17：MISC流水号 : 001400007263738   13625815738<font color=red>       神州行本地</font>      2011-03-10 09:26:11<font color=red>       2011-03-10 21:26:11</font>      紧急<br/>      【受理号码：】13625815738@~【业务名称：】校讯通一类套餐A@~【订购时间：】2010-10-28 18:11:06@~【学校名称：】杭州萧山瓜里三小@~【用户的诉求：】用户表示自己短信收不到要求处理。@~【有效的联系电话及联系：】本人/本机<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>18：MISC流水号 : 001400007263728   13429298647<font color=red>       神州行本地</font>      2011-03-10 09:10:39<font color=red>       2011-03-10 21:10:39</font>      紧急<br/>      【受理号码：】13429298647@~【业务名称：】校讯通 @~【订购时间：】2009-09-25 03:10:05@~【学校名称：】惠贞书院小学@~【用户的诉求：】用户反映从3月8日开始又收不到此业务短信了,现来电投诉,普通短信接收还是正常的,请帮助处理回复,谢谢.@~【有效的联系电话及联系：】13429298647,小姐<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>19：MISC流水号 : 001400007263723   13456130602<font color=red>       神州行本地</font>      2011-03-10 08:40:20<font color=red>       2011-03-10 20:40:20</font>      紧急<br/>      【受理号码：】13456130602@~【业务名称：】校讯通@~【订购时间：】2010-10-26 17:40:34@~【学校名称：】宁波市新芝幼儿园总园@~【用户的诉求：】用户反映最近3、4天校讯通的刷卡信息都没有收到，请处理，谢谢。@~【有效的联系电话及联系：】13456130602洪先生<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>20：MISC流水号 : 001400007263717   13968281878<font color=red>       神州行本地</font>      2011-03-10 08:12:11<font color=red>       2011-03-10 20:12:11</font>      紧急<br/>      【受理号码：】13968281878@~【业务名称：】校讯通@~【订购时间：】@~【学校名称：】@~【用户的诉求：】用户来电反映没有订购校讯通业务，却收到短信，来电要求我方帮其屏蔽，请处理@~【有效的联系电话及联系：】13968281878，小姐<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>21：MISC流水号 : 001400007263716   15157450798<font color=red>       神州行本地</font>      2011-03-10 08:11:01<font color=red>       2011-03-10 20:11:01</font>      紧急<br/>      【受理号码：】15157450798@~【业务名称：】校讯通@~【订购时间：】@~【学校名称：】@~【用户的诉求：】用户来电反应自己没有开通过校讯通，却一直收到校讯通短信，用户觉得很烦人，要求帮忙解决，无法与用户核实是什么学校发送的信息，用户态度强烈，请核实处理，谢谢！@~【有效的联系电话及联系：】15157450798孙满洲<br/><span><font color=red>自动处理程序失败原因:没找到对应的电话号码<font></span><br/><br/>";
		System.out.println(message.length());
		message = message.replace(" ", "");
		System.out.println(message.length());

		
		MailBoxService src = null;
	
		String targetMail =args.length>0?args[0]:"109006340@qq.com";
		
		int type = args.length>2?(!"".equals(args[1])?Integer.parseInt(args[1]):0):0;
		
		while(type==0){
			
		if(type==0){
			 System.out.println("输入对应的数字选择邮箱发送(0 ~ 3, -1 跳出程序)......");
			 BufferedReader stdin =new BufferedReader(new InputStreamReader(System.in)); 
			 String temp = stdin.readLine();
			 type = Integer.parseInt(new String(temp));
		}
		if(type==-1)
			break;
		
				switch(type){
				
					 case 0:{
						 
						    System.out.println("使用alex86825@163.com发送  到"+targetMail);
							src = new MailBoxService("alex86825@163.com",
									"smtp.163.com", "alex86825", "alex672988", "true", true);
			
							src.sendMail(targetMail,
									"test_alex672988" + Math.random(), message);
			
							break;
						}
					 
						case 1:{
							
							System.out.println("使用zjxxtnoticer@163.com发送 到"+targetMail);
							src = new MailBoxService("zjxxtnoticer@163.com",
									"smtp.163.com", "zjxxtnoticer", "zjxxt0760", "true", true);
			
							src.sendMail(targetMail,
									"hello_zjxxtnoticer163" + Math.random(), message);
			
							break;
							
						}
						
						case 2:{
							
							System.out.println("使用zjxxtnoticer@sina.cn发送 到"+targetMail);
							src = new MailBoxService("zjxxtnoticer@sina.cn",
									"smtp.sina.cn", "zjxxtnoticer", "zjxxt0760", "true", true);
			
							src.sendMail(targetMail,
									"hello_zjxxtnoticersina" + Math.random(), message);
							
							break;
						}
						
						
		                case 3:{
							
		                	
							System.out.println("使用zjxxtnoticer@sina.cn发送 到"+targetMail);
							src = new MailBoxService("zjxxtnoticer@sina.cn",
									"smtp.sina.cn", "zjxxtnoticer", "zjxxt0760", "true", true);
			
							src.sendMail(targetMail,
									"hello_zjxxtnoticersina" + Math.random(), message);
							
							
							
							System.out.println("使用zjxxtnoticer@sina.cn发送 到"+targetMail);
							src = new MailBoxService("zjxxtnoticer@sina.cn",
									"smtp.sina.cn", "zjxxtnoticer", "zjxxt0760", "true", true);
			
							src.sendMail(targetMail,
									"hello_zjxxtnoticersina" + Math.random(), message);
							
							
							
							System.out.println("使用zjxxtnoticer@163.com发送 到"+targetMail);
							src = new MailBoxService("zjxxtnoticer@163.com",
									"smtp.163.com", "zjxxtnoticer", "zjxxt0760", "true", true);
			
							src.sendMail(targetMail,
									"hello_zjxxtnoticer163" + Math.random(), message);
			
							
							break;
						}
				}
				type=0;
		}
		
	}

}
